Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/lcd_utlis/source/image_conv.c
/******************************************************************************
* Function Name: ifx_pixel_RGB565_to_RGB888
*******************************************************************************
* Summary:
*  Converts a color pixel value from RGB565 format (16 bits: 5 bits red, 6 
*  bits green, 5 bits blue) to RGB888 format (24 bits: 8 bits per channel) 
*  and stores the result in the provided buffer. Supports multiple conversion
*  modes: default (low 2 or 3 bits set to 0), full 8-bit usage, or full 8-bit 
*  usage with rounding.
*
* Parameters:
*  uint16_t rgb565: 16-bit color value in RGB565 format
*  uint8_t *rgb888: Pointer to the 24-bit color buffer for storing RGB888 
*                   values
*
* Return:
*  uint8_t*: Pointer to the next position in the 24-bit color buffer
*
******************************************************************************/
inline uint8_t * ifx_pixel_RGB565_to_RGB888( uint32_t rgb565, uint8_t *rgb888 )
{
    /* Extract B, G, and R components from BGR565 pixel (already in BGR order) */
    uint32_t    blue  = (rgb565 << 3) & 0xF8u;      /* [0, 248], Extract lower 5 bits for blue */
    uint32_t    green = (rgb565 >> 3) & 0xFCu;      /* [0, 252], Extract middle 6 bits for green, right shift 5 for 8-bit representation */
    uint32_t    red   = (rgb565 >> 8) & 0xF8u;      /* [0, 248], Extract upper 5 bits for red, right shift 11 for 8-bit representation */

#ifdef BGR888_FULL_8_BIT
    red   = (red   * 66) >> 6;
    green = (green * 65) >> 6;
    blue  = (blue  * 66) >> 6;
#endif  /* BGR888_FULL_8_BIT */

    *rgb888++ = (uint8_t)red;
    *rgb888++ = (uint8_t)green;
    *rgb888++ = (uint8_t)blue;

    return rgb888;
}

/******************************************************************************
* Function Name: ifx_pixel_2_RGB565_to_RGB888
*******************************************************************************
* Summary:
*  Converts two RGB565 color pixel values (packed in a 32-bit integer) to 
*  RGB888 format and stores the result in the provided buffer. Supports full 
*  8-bit usage conversion if BGR888_FULL_8_BIT is defined. Processes two 
*  pixels at a time.
*
* Parameters:
*  uint32_t rgb565: 32-bit value containing two RGB565 pixels (low 16-bit: 
*                   first pixel, high 16-bit: second pixel)
*  uint8_t *rgb888: Pointer to the 24-bit RGB888 color buffer for storing 
*                   the result
*
* Return:
*  uint8_t*: Pointer to the next position in the RGB888 color buffer
*
******************************************************************************/
inline uint8_t * ifx_pixel_2_RGB565_to_RGB888( uint32_t rgb565, uint8_t *rgb888 )
{
    /* Extract B, G, and R components from BGR565 pixel (already in BGR order) */
    /* low 16-bit: the first pixel, high 16-bit: the second pixel */
    uint32_t    blue  = (rgb565 << 3) & 0x0F800F8u;     /* xxB1 | xxB0 */
    uint32_t    green = (rgb565 >> 3) & 0x0FC00FCu;     /* xxG1 | xxG0 */
    uint32_t    red   = (rgb565 >> 8) & 0x0F800F8u;     /* xxR1 | xxR0 */

#ifdef BGR888_FULL_8_BIT
    red   = (red   * 66) >> 6;
    green = (green * 65) >> 6;
    blue  = (blue  * 66) >> 6;
#endif  /* BGR888_FULL_8_BIT */

    uint16_t    *rgb888_16p = (uint16_t *)rgb888;
    uint32_t    rg = (green << 8) | red;        /* G1R1 | G0R0* */
    uint32_t    br = (red   >> 8) | blue;       /* xxB1 | R1B0* */
    uint32_t    gb = (blue  << 8) | green;      /* B1G1*| B0G0 */

    *rgb888_16p++ = (uint16_t)rg;
    *rgb888_16p++ = (uint16_t)br;
    *rgb888_16p++ = (uint16_t)(gb >> 16);

    return (uint8_t *)rgb888_16p;
}

/******************************************************************************
* Function Name: ifx_pixel_RGB565_to_RGB888_u2i
*******************************************************************************
* Summary:
*  Converts a single RGB565 color pixel value to RGB888 format with an 
*  optional zero-point offset for int8_t output. Stores the result in the 
*  provided buffer.Supports full 8-bit usage conversion if BGR888_FULL_8_BIT 
*  is defined.
*
* Parameters:
*  uint32_t rgb565: 16-bit RGB565 color value
*  int8_t *rgb888: Pointer to the 24-bit RGB888 color buffer for storing the 
*                   result
*  int32_t zero_point: Zero-point offset to apply to the output values
*
* Return:
*  int8_t*: Pointer to the next position in the RGB888 color buffer
*
******************************************************************************/
inline int8_t * ifx_pixel_RGB565_to_RGB888_u2i( uint32_t rgb565, int8_t *rgb888, int32_t zero_point )
{
    /* Extract B, G, and R components from BGR565 pixel (already in BGR order) */
    int blue   = (rgb565 << 3) & 0x0F8;         /* Extract lower 5 bits for blue */
    int green  = (rgb565 >> 3) & 0x0FC;         /* Extract middle 6 bits for green, right shift 5 for 8-bit representation */
    int red    = (rgb565 >> 8) & 0x0F8;         /* Extract upper 5 bits for red, right shift 11 for 8-bit representation */

#ifdef BGR888_FULL_8_BIT
    red   = (red   * 66) >> 6;
    green = (green * 65) >> 6;
    blue  = (blue  * 66) >> 6;
#endif  /* BGR888_FULL_8_BIT */

    *rgb888++ = red   + zero_point;
    *rgb888++ = green + zero_point;
    *rgb888++ = blue  + zero_point;

    return rgb888;
}

/******************************************************************************
* Function Name: ifx_pixel_2_RGB565_to_RGB888_u2i
*******************************************************************************
* Summary:
*  Converts two RGB565 color pixel values (packed in a 32-bit integer) to 
*  RGB888 format with an optional zero-point offset for int8_t output. Stores 
*  the result in the provided buffer. Supports full 8-bit usage conversion if 
*  BGR888_FULL_8_BIT is defined and uses SIMD instructions for optimization if 
*  ARM_MATH_DSP is defined.
*
* Parameters:
*  uint32_t rgb565: 32-bit value containing two RGB565 pixels (low 16-bit: 
*                   first pixel, high 16-bit: second pixel)
*  int8_t *rgb888: Pointer to the 24-bit RGB888 color buffer for storing the 
*                   result
*  int32_t zero_point: Zero-point offset to apply to the output values
*
* Return:
*  int8_t*: Pointer to the next position in the RGB888 color buffer
*
******************************************************************************/
int8_t * ifx_pixel_2_RGB565_to_RGB888_u2i( uint32_t rgb565, int8_t *rgb888, int32_t zero_point )
{
    /* Extract B, G, and R components from BGR565 pixel (already in BGR order) */
    /* low 16-bit: the first pixel, high 16-bit: the second pixel */
    int32_t blue   = (rgb565 << 3) & 0x0F800F8;     /* Extract lower 5 bits for blue */
    int32_t green  = (rgb565 >> 3) & 0x0FC00FC;     /* Extract middle 6 bits for green, right shift 5 for 8-bit representation */
    int32_t red    = (rgb565 >> 8) & 0x0F800F8;     /* Extract upper 5 bits for red, right shift 11 for 8-bit representation */

#ifdef BGR888_FULL_8_BIT
    red   = (red   * 66) >> 6;
    green = (green * 65) >> 6;
    blue  = (blue  * 66) >> 6;
#endif  /* BGR888_FULL_8_BIT */

#if defined (ARM_MATH_DSP)
    int32_t zero_point_packed;      /* Offset packed to 32 bit */

    /* Offset is packed to 32 bit in order to use SIMD32 for addition */
    zero_point_packed = __PKHBT(zero_point, zero_point, 16);
    /* Add offset and store result in destination buffer (2 samples at a time). */
    red   = __QADD16(red,   zero_point_packed);
    green = __QADD16(green, zero_point_packed);
    blue  = __QADD16(blue,  zero_point_packed);

    /* the first pixel */
    *rgb888++ = (int8_t)(red);
    *rgb888++ = (int8_t)(green);
    *rgb888++ = (int8_t)(blue);
    /* the second pixel */
    *rgb888++ = (int8_t)((red   >> 16));
    *rgb888++ = (int8_t)((green >> 16));
    *rgb888++ = (int8_t)((blue  >> 16));
#else
    /* the first pixel */
    *rgb888++ = (int8_t)((red  ) + zero_point);
    *rgb888++ = (int8_t)((green) + zero_point);
    *rgb888++ = (int8_t)((blue ) + zero_point);
    /* the second pixel */
    *rgb888++ = (int8_t)(((red   >> 16)) + zero_point);
    *rgb888++ = (int8_t)(((green >> 16)) + zero_point);
    *rgb888++ = (int8_t)(((blue  >> 16)) + zero_point);
#endif

    return rgb888;
}

#ifdef ARM_MATH_MVEI

