Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/lcd_utlis/source/image_conv.c
#define get_write_RGB(src)    \
            *rgb888_16p++ = (uint16_t)vgetq_lane_u16( RG, src );      \
            *rgb888_16p++ = (uint16_t)vgetq_lane_u16( BR, src + 1 );  \
            *rgb888_16p++ = (uint16_t)vgetq_lane_u16( GB, src + 1 )

/* ifx_image_conv_RGB565_to_RGB888_16_narrow */
CY_SECTION_ITCM_BEGIN
/******************************************************************************
* Function Name: ifx_image_conv_RGB565_to_RGB888
*******************************************************************************
* Summary:
*  Converts the entire image from RGB565 format (16 bits per pixel) to RGB888
*  format (24 bits per pixel). If the source image is wider than the ,
*  destination copies the center part and ignores the side portions. If the 
*  source image is shorter in height than the destination, fills the extra 
*  destination rows with padding.
*
* Parameters:
*  uint16_t *rgb565: Pointer to the source 16-bit RGB565 image buffer
*  int width: Width of the source image
*  int height: Height of the source image
*  uint8_t *rgb888: Pointer to the destination 24-bit RGB888 image buffer
*  int dst_w: Width of the destination image
*  int dst_h: Height of the destination image
*
* Return:
*  void
*
******************************************************************************/
void ifx_image_conv_RGB565_to_RGB888( uint8_t *src_bgr565, int32_t width, int32_t height,
                                      uint8_t *dst_rgb888, int32_t dst_width, int32_t dst_height )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width,  dst_width );
    int offset_width = ( width - min_width ) >> 1;
    int blk_cnt      = min_width >> 3;              /* 8-pixel block: 16-byte: 128-bit */
    int blk_remainder= min_width & 0x07;
    uint16_t   *src_bgr565_16p = (uint16_t *) &src_bgr565[offset_width << 1];   /* 2 bytes per pixel */
    uint16x8_t  vmask_red_blue = vdupq_n_u16( 0xF800u );
    uint16x8_t  vmask_green    = vdupq_n_u16( 0xFC00u );

    for ( int i = 0; i < min_height; i++ ) 
    {
        uint16_t    *rgb888_16p = (uint16_t *)&dst_rgb888[i * dst_width * 3];   /* 3 bytes per pixel */
        uint16_t    *bgr565_16p = &src_bgr565_16p[i * width];

        for (int jj = blk_cnt; jj > 0; jj--, bgr565_16p += 8)
        {
            /* process 8 16-bit RGB565 colors (pixels) simultaneously in the vector unit */
            uint16x8_t  bgr565 = vldrhq_u16( bgr565_16p );  /* load 8 16-bit RGB565 into a vector reg. */
            uint16x8_t  red    = bgr565;                    /* move R to the high-bytes */
            uint16x8_t  green  = vshlq_n_u16( bgr565,  5 ); /* move G to the high-bytes */
            uint16x8_t  blue   = vshlq_n_u16( bgr565, 11 ); /* move B to the high-bytes */

            /* clear not-relavant bits in each color vector */
            red   = vandq_u16( red,   vmask_red_blue );     /* R3-- | R2-- | R1-- | R0-- */
            green = vandq_u16( green, vmask_green );        /* G3-- | G2-- | G1-- | G0-- */
            blue  = vandq_u16( blue,  vmask_red_blue );     /* B3-- | B2-- | B1-- | B0-- */

            /* shift colors to the high-bytes to combine with the low-byte in other colors */
            uint16x8_t  Bs = (uint16x8_t)vshlq_n_u32( (uint32x4_t)blue, 8 );            /* --B2 | --xx | --B0 | --xx */

            /* combine the high-bytes and the low-bytes into 2-byte words */
            uint16x8_t  RG = (uint16x8_t)vshrnbq_n_u16( (uint8x16_t)green, red, 8 );    /* G3R3 |*G2R2*| G1R1 |*G0R0* */
            uint16x8_t  BR = vorrq_u16( Bs, red );                                      /**R3B2*| R1xx |*R1B0*| R0xx */
            uint16x8_t  GB = (uint16x8_t)vshrnbq_n_u16( (uint8x16_t)blue, green, 8 );   /**B3G3*| B2G2 |*B1G1*| B0G0 */

            get_write_RGB(0);
            get_write_RGB(2);
            get_write_RGB(4);
            get_write_RGB(6);
        }
        if ( blk_remainder > 0 ) 
        {
            uint8_t *rgb888 = (uint8_t *)rgb888_16p;

            for ( int jj = blk_remainder; jj > 0; jj-- ) 
            {
                uint16_t    pixel = *bgr565_16p++;

                rgb888 = ifx_pixel_RGB565_to_RGB888( pixel, rgb888 );
            }
        }
    }
}
CY_SECTION_ITCM_END

#define get_write_RGB_u2i(idx)    \
            *rgb888_8p++ = (int8_t)vgetq_lane_s16( red,   idx );  \
            *rgb888_8p++ = (int8_t)vgetq_lane_s16( green, idx );  \
            *rgb888_8p++ = (int8_t)vgetq_lane_s16( blue,  idx )

/******************************************************************************
* Function Name: ifx_image_conv_RGB565_to_RGB888_u2i
*******************************************************************************
* Summary:
*  Converts an entire image from RGB565 format (16 bits per pixel) to RGB888
*  format (24 bits per pixel) with a zero-point offset for int8_t output, using
*  SIMD optimizations for processing eight pixels simultaneously. If the source
*  image is wider than the destination, copies the center part and ignores side
*  portions. If the source image is shorter in height, processes only the 
*  minimum height.
*
* Parameters:
*  uint8_t *src_bgr565: Pointer to the source RGB565 image buffer
*  int32_t width: Width of the source image
*  int32_t height: Height of the source image
*  int8_t *dst_rgb888_i8: Pointer to the destination RGB888 image buffer (int8_t)
*  int32_t dst_width: Width of the destination image
*  int32_t dst_height: Height of the destination image
*  int32_t zero_point: Zero-point offset to apply to the output values
*
* Return:
*  void
*
******************************************************************************/
void ifx_image_conv_RGB565_to_RGB888_u2i( uint8_t *src_bgr565, int32_t width, int32_t height,
                                          int8_t *dst_rgb888_i8, int32_t dst_width, int32_t dst_height,
                                          int32_t zero_point )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width,  dst_width );
    int offset_width = ( width - min_width ) >> 1;
    int blk_cnt      = width >> 3;
    int blk_remainder= width & 0x07;
    uint16_t   *src_bgr565_16p = (uint16_t *) &src_bgr565[offset_width << 1];   /* 2 bytes per pixel */
    int16x8_t   vmask_red_blue = vdupq_n_s16( 0x0F8 );
    int16x8_t   vmask_green    = vdupq_n_s16( 0x0FC );
    int16x8_t   vzero_point    = vdupq_n_s16( zero_point );

    for (int i = 0; i < min_height; i++) 
    {
        int8_t      *rgb888_8p  = &dst_rgb888_i8[i * dst_width * 3];   /* 3 bytes per pixel */
        uint16_t    *bgr565_16p = &src_bgr565_16p[i * width];

