Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/lcd_utlis/source/image_conv.c
        for (int jj = blk_cnt; jj > 0; jj--, bgr565_16p += 8) 
        {
            /* process 8 16-bit RGB565 colors (pixels) simultaneously in the vector unit */
            uint16x8_t bgr565 = vldrhq_u16( bgr565_16p );                           /* load 8 16-bit RGB565 into a vector reg. */
            int16x8_t  red    = vreinterpretq_s16_u16(vshrq_n_u16( bgr565, 8 ));    /* move R to the low-bytes */
            int16x8_t  green  = vreinterpretq_s16_u16(vshrq_n_u16( bgr565, 3 ));    /* move G to the low-bytes */
            int16x8_t  blue   = vreinterpretq_s16_u16(vshlq_n_u16( bgr565, 3 ));    /* adjust B to the low-bytes */

            /* clear not-relavant bits in each color vector */
            red   = vandq_s16( red,   vmask_red_blue );     /* --R3 | --R2 | --R1 | --R0 */
            green = vandq_s16( green, vmask_green );        /* --G3 | --G2 | --G1 | --G0 */
            blue  = vandq_s16( blue,  vmask_red_blue );     /* --B3 | --B2 | --B1 | --B0 */

            red   = vaddq_s16( vzero_point, red );
            green = vaddq_s16( vzero_point, green );
            blue  = vaddq_s16( vzero_point, blue );

            get_write_RGB_u2i(0);
            get_write_RGB_u2i(1);
            get_write_RGB_u2i(2);
            get_write_RGB_u2i(3);
            get_write_RGB_u2i(4);
            get_write_RGB_u2i(5);
            get_write_RGB_u2i(6);
            get_write_RGB_u2i(7);
        }
        if ( blk_remainder > 0 ) 
        {
            for ( int jj = blk_remainder; jj > 0; jj-- ) 
            {
                uint16_t    pixel = *bgr565_16p++;

                rgb888_8p = ifx_pixel_RGB565_to_RGB888_u2i( pixel, rgb888_8p, zero_point );
            }
        }
    }
}

#else

CY_SECTION_ITCM_BEGIN
/******************************************************************************
* Function Name: ifx_image_conv_RGB565_to_RGB888
*******************************************************************************
* Summary:
*  Converts an entire image from RGB565 format (16 bits per pixel) to RGB888
*  format (24 bits per pixel). If the source image is wider than the ,
*  destination copies the center part and ignores side portions. If the source 
*  image is shorter in height, processes only the minimum height. Processes 
*  two pixels at a time for efficiency.
*
* Parameters:
*  uint8_t*src_bgr565: Pointer to the source RGB565 image buffer
*  int32_t width: Width of the source image
*  int32_t height: Height of the source image
*  uint8_t*dst_rgb888: Pointer to the destination RGB888 image buffer
*  int32_t dst_width: Width of the destination image
*  int32_t dst_height: Height of the destination image
*
* Return:
*  void
*
******************************************************************************/
void ifx_image_conv_RGB565_to_RGB888( uint8_t *src_bgr565, int32_t width, int32_t height,
                                      uint8_t *dst_rgb888, int32_t dst_width, int32_t dst_height )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width,  dst_width );
    int offset_width = ( width - min_width ) >> 1;      /* positive offset, if the source is wider */
    uint16_t    *src_bgr565_16p = (uint16_t *) &src_bgr565[offset_width << 1];   /* 2 bytes per pixel */

    for ( int i = 0; i < min_height; i++ ) 
    {
        uint8_t     *rgb888     = &dst_rgb888[i * dst_width * 3];   /* 3 bytes per pixel */
        uint32_t    *bgr565_32p = (uint32_t *)&src_bgr565_16p[i * width];

        for ( int j = (min_width >> 1); j > 0; j-- ) 
        {
            /* Two-pixel RGB565 memory-access: one 32-bit read of 4-byte */
            uint32_t    pixel = *bgr565_32p++;

#if 1
            rgb888 = ifx_pixel_2_RGB565_to_RGB888( pixel, rgb888 );
#else
            /* process low (15:0) first pixel */
            rgb888 = ifx_pixel_RGB565_to_RGB888( pixel, rgb888 );

            /* process high (31:16) second pixel */
            rgb888 = ifx_pixel_RGB565_to_RGB888( pixel >> 16, rgb888 );
#endif  /* 0/1 */
        }
    }
}
CY_SECTION_ITCM_END

/******************************************************************************
* Function Name: ifx_image_conv_RGB565_to_RGB888_u2i
*******************************************************************************
* Summary:
*  Converts an entire image from RGB565 format (16 bits per pixel) to RGB888
*  format (24 bits per pixel) with a zero-point offset for int8_t output. If 
*  the source image is wider than the destination, copies the center part and 
*  ignores side portions. If the source image is shorter in height, processes 
*  only the minimum height. Processes two pixels at a time for efficiency.
*
* Parameters:
*  uint8_t *src_bgr565: Pointer to the source RGB565 image buffer
*  int32_t width: Width of the source image
*  int32_t height: Height of the source image
*  int8_t *dst_rgb888_i8: Pointer to the destination RGB888 image buffer 
*                         (int8_t)
*  int32_t dst_width: Width of the destination image
*  int32_t dst_height: Height of the destination image
*  int32_t zero_point: Zero-point offset to apply to the output values
*
* Return:
*  void
*
******************************************************************************/

void ifx_image_conv_RGB565_to_RGB888_u2i( uint8_t *src_bgr565, int32_t width, int32_t height,
                                          int8_t *dst_rgb888_i8, int32_t dst_width, int32_t dst_height,
                                          int32_t zero_point )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width, dst_width );
    int offset_width = ( width - min_width ) >> 1;
    uint16_t    *src_bgr565_16p = (uint16_t *) &src_bgr565[offset_width << 1];  /* 2 bytes per pixel */

    for ( int i = 0; i < min_height; i++ ) 
    {
        int8_t      *rgb888     = &dst_rgb888_i8[i * dst_width * 3];     /* 3 bytes per pixel */
        uint32_t    *bgr565_32p = (uint32_t *)&src_bgr565_16p[i * width];

        for ( int j = (min_width >> 1); j > 0; j-- ) 
        {
            /* Two-pixel RGB565 memory-access: one 32-bit read of 4-byte */
            uint32_t    pixel = bgr565_32p++;

#if 1
            rgb888 = ifx_pixel_2_RGB565_to_RGB888_u2i( pixel, rgb888, zero_point );
#else
            /* process low (15:0) first pixel */
            rgb888 = ifx_pixel_RGB565_to_RGB888_u2i( pixel, rgb888, zero_point );

            /* process high (31:16) second pixel */
            rgb888 = ifx_pixel_RGB565_to_RGB888_u2i( pixel >> 16, rgb888, zero_point );
#endif  /* 0/1 */
        }
    }
}

#endif  /* ARM_MATH_MVEI */


