Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/lcd_utlis/source/image_conv.c
/******************************************************************************
* Function Name: ifx_image_conv_RGB565_to_RGB888_quant
*******************************************************************************
* Summary:
*  Converts an entire image from RGB565 format (16 bits per pixel) to RGB888
*  format (24 bits per pixel) with quantization, applying a scale factor and
*  zero-point offset for int8_t output. If the source image is wider or taller
*  than the destination, processes only the minimum width and height.
*
* Parameters:
*  uint8_t *src_bgr565: Pointer to the source RGB565 image buffer
*  int32_t width: Width of the source image
*  int32_t height: Height of the source image
*  int8_t *dst_rgb888_i8: Pointer to the destination RGB888 image buffer 
*                         (int8_t)
*  int32_t dst_width: Width of the destination image
*  int32_t dst_height: Height of the destination image
*  float scale: Scale factor for quantization
*  int32_t zero_point: Zero-point offset to apply to the output values
*
* Return:
*  void
*
******************************************************************************/
void ifx_image_conv_RGB565_to_RGB888_quant( uint8_t *src_bgr565, int32_t width, int32_t height,
                                            int8_t *dst_rgb888_i8, int32_t dst_width, int32_t dst_height,
                                            float scale, int32_t zero_point )
{
    float   inv_scale    = 1.0f / scale;
    float   zero_point_f = (float) zero_point;
    uint8_t *dst_rgb888  = (uint8_t *) dst_rgb888_i8;

    ifx_image_conv_RGB565_to_RGB888( src_bgr565, width, height, dst_rgb888, dst_width, dst_height );

    for ( int ii = 0; ii < dst_width * dst_height; ii++ ) 
    {
        *dst_rgb888_i8++ = (int8_t)( inv_scale * (*dst_rgb888++) + zero_point_f );
        *dst_rgb888_i8++ = (int8_t)( inv_scale * (*dst_rgb888++) + zero_point_f );
        *dst_rgb888_i8++ = (int8_t)( inv_scale * (*dst_rgb888++) + zero_point_f );
    }
}

/******************************************************************************
* Function Name: RGB565_to_RGB888_i8
*******************************************************************************
* Summary:
*  Converts a single RGB565 color pixel value to RGB888 format with a fixed
*  zero-point offset of -128 for int8_t output. Supports multiple conversion
*  modes:default (low bits set to 0), full 8-bit usage, or full 8-bit usage 
*  with rounding based on BGR888_FULL_8_BIT and BGR888_FULL_8_BIT_ROUND 
*  definitions.
*
* Parameters:
*  uint32_t pixel: 16-bit RGB565 color value
*  int8_t *rgb888_8p: Pointer to the destination RGB888 buffer (int8_t)
*
* Return:
*  int8_t*: Pointer to the next position in the RGB888 buffer
*
******************************************************************************/
int8_t * RGB565_to_RGB888_i8( uint32_t pixel, int8_t *rgb888_8p )
{
    /* Extract B, G, and R components from BGR565 pixel (already in BGR order) */
    uint8_t    blue   = (pixel << 3) & 0x0F8;            /* Extract lower 5 bits for blue */
    uint8_t    green  = (pixel >> 3) & 0x0FC;            /* Extract middle 6 bits for green, right shift 5 for 8-bit representation */
    uint8_t    red    = (pixel >> 8) & 0x0F8;            /* Extract upper 5 bits for red, right shift 11 for 8-bit representation */

#ifndef BGR888_FULL_8_BIT
    *rgb888_8p++ = red   - 128;
    *rgb888_8p++ = green - 128;
    *rgb888_8p++ = blue  - 128;
#else

#ifndef BGR888_FULL_8_BIT_ROUND
    *rgb888_8p++ = (red    | (red    >> 5))  - 128;
    *rgb888_8p++ = (green  | (green  >> 6))  - 128;
    *rgb888_8p++ = (blue   | (blue   >> 5))  - 128;
#else
    *rgb888_8p++ = (red    | (red    >> 5) | ((red   >> 4) & 0x01))  - 128;    /* (significant 5-bit) | (low 3-bit with high 3-bit) | (round with 4th high bit) */
    *rgb888_8p++ = (green  | (green  >> 6) | ((green >> 5) & 0x01))  - 128;    /* (significant 6-bit) | (low 2-bit with high 2-bit) | (round with 3rd high bit) */
    *rgb888_8p++ = (blue   | (blue   >> 5) | ((blue  >> 4) & 0x01))  - 128;    /* (significant 5-bit) | (low 3-bit with high 3-bit) | (round with 4th high bit) */
#endif  /* BGR888_FULL_8_BIT_ROUND */

#endif  /* BGR888_FULL_8_BIT */

    return rgb888_8p;
}

/******************************************************************************
* Function Name: ifx_image_conv_RGB565_to_RGB888_i8
*******************************************************************************
* Summary:
*  Converts an entire image from RGB565 format (16 bits per pixel) to RGB888
*  format (24 bits per pixel) with a fixed zero-point offset of -128 for 
*  int8_t output. If the source image is wider than the destination, copies 
*  the center part and ignores side portions. Supports 32-bit or 16-bit memory 
*  access based on BGR565_32bit_MEMORY_ACCESS definition.
*
* Parameters:
*  uint8_t *src_bgr565: Pointer to the source RGB565 image buffer
*  int width: Width of the source image
*  int height: Height of the source image
*  int8_t *dst_rgb888_i8: Pointer to the destination RGB888 image buffer 
*                         (int8_t)
*  int dst_width: Width of the destination image
*  int dst_height: Height of the destination image
*
* Return:
*  void
*
******************************************************************************/
void ifx_image_conv_RGB565_to_RGB888_i8( uint8_t *src_bgr565, int width, int height,
    int8_t *dst_rgb888_i8, int dst_width, int dst_height )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width, dst_width );
    int offset_width = ( width - min_width ) / 2;

    for ( int i = 0; i < min_height; i++ ) 
    {
        int8_t  *rgb888_8p = &dst_rgb888_i8[i * dst_width * 3];
        uint8_t *bgr565_8p = &src_bgr565[(i * width + offset_width) * 2];
#ifdef BGR565_32bit_MEMORY_ACCESS   /* 32-bit two-pixel memory-access */
        uint32_t    *bgr565_32p = (uint32_t *)bgr565_8p;

        for ( int j = 0; j < min_width / 2; j++ ) 
        {
            uint32_t    pixel = *bgr565_32p++;

            /* process low (15:0) first pixel */
            rgb888_8p = RGB565_to_RGB888_i8( pixel, rgb888_8p );

            /* process high (31:16) second pixel */
            rgb888_8p = RGB565_to_RGB888_i8( pixel >> 16, rgb888_8p );
        }
#else   /* 16-bit one-pixel memory-access */
        uint16_t    *bgr565_16p = (uint16_t *)bgr565_8p;
        for ( int j = 0; j < min_width; j++ ) 
        {
            uint16_t pixel = *bgr565_16p++;

            rgb888_8p = RGB565_to_RGB888_i8( pixel, rgb888_8p );
        }
        #endif  /* BGR565_32bit_MEMORY_ACCESS */
    }
}

