Infineon/mtb-example-psoc-edge-rock-paper-scissors-detection/proj_cm55/lcd_utlis/source/image_conv.c
/******************************************************************************
* Function Name: ifx_pixel_RGB888_to_RGBX32
*******************************************************************************
* Summary:
*  Converts RGB888 color values (8 bits per channel) to a 32-bit RGBX format,
*  combining red, green, and blue components into a single 32-bit value with
*  an unused byte.
*
* Parameters:
*  uint32_t r: Red color value (0-255)
*  uint32_t g: Green color value (0-255)
*  uint32_t b: Blue color value (0-255)
*
* Return:
*  uint32_t: 32-bit RGBX color value
*
******************************************************************************/
inline uint32_t ifx_pixel_RGB888_to_RGBX32( uint32_t r, uint32_t g, uint32_t b )
{
    return ((r << 16) | (g << 8) | b);
}

/******************************************************************************
* Function Name: ifx_pixel_xRGB32_to_RGB565
*******************************************************************************
* Summary:
*  Converts a 32-bit RGBX color value to RGB565 format (16 bits: 5 bits red,
*  6 bits green, 5 bits blue).
*
* Parameters:
*  uint32_t xRGB: 32-bit RGBX color value
*
* Return:
*  uint16_t: 16-bit RGB565 color value
*
******************************************************************************/
inline uint16_t ifx_pixel_xRGB32_to_RGB565( uint32_t xRGB )
{
    uint16_t    r = (xRGB >> 8) & 0xF800u;
    uint16_t    g = (xRGB >> 5) & 0x07E0u;
    uint16_t    b = (xRGB >> 3) & 0x001Fu;

    return (uint16_t)(r | g | b);
}

/******************************************************************************
* Function Name: ifx_image_conv_RGBX32_to_RGB24
*******************************************************************************
* Summary:
*  Converts an entire image from RGBX32 format (32 bits per pixel) to RGB888
*  format (24 bits per pixel). If the source image is wider than the 
*  destination,copies the center part and ignores side portions. If the 
*  source image is shorter in height, processes only the minimum height.
*
* Parameters:
*  uint8_t *src_rgbx32: Pointer to the source RGBX32 image buffer
*  int32_t width: Width of the source image
*  int32_t height: Height of the source image
*  uint8_t *dst_rgb888: Pointer to the destination RGB888 image buffer
*  int32_t dst_width: Width of the destination image
*  int32_t dst_height: Height of the destination image
*
* Return:
*  void
*
******************************************************************************/
void ifx_image_conv_RGBX32_to_RGB24( uint8_t *src_rgbx32, int32_t width, int32_t height,
                                     uint8_t *dst_rgb888, int32_t dst_width, int32_t dst_height )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width, dst_width );
    int offset_width = ( width - min_width ) >> 1;
    uint32_t    *src_32p = (uint32_t *)&src_rgbx32[offset_width << 1];

    for ( int i = 0; i < min_height; i++ ) 
    {
        uint8_t     *dp = &dst_rgb888[i * dst_width * 3];
        uint32_t    *sp = &src_32p[i * width];

        for ( int j = 0; j < min_width; j++ ) 
        {
            uint32_t    pixel = *sp++;

            *dp++ = (uint8_t)(pixel >> 16);
            *dp++ = (uint8_t)(pixel >>  8);
            *dp++ = (uint8_t)(pixel);
        }
    }
}

/******************************************************************************
* Function Name: ifx_image_conv_RGBX32_to_RGB24_u2i
*******************************************************************************
* Summary:
*  Converts an entire image from RGBX32 format (32 bits per pixel) to RGB888
*  format (24 bits per pixel) with a zero-point offset for int8_t output. If 
*  the source image is wider than the destination, copies the center part and 
*  ignores side portions. If the source image is shorter in height, processes 
*  only the minimum height.
*
* Parameters:
*  uint8_t *src_rgbx32: Pointer to the source RGBX32 image buffer
*  int32_t width: Width of the source image
*  int32_t height: Height of the source image
*  int8_t *dst_rgb888: Pointer to the destination RGB888 image buffer (int8_t)
*  int32_t dst_width: Width of the destination image
*  int32_t dst_height: Height of the destination image
*  int32_t zero_point: Zero-point offset to apply to the output values
*
* Return:
*  void
*
******************************************************************************/
void ifx_image_conv_RGBX32_to_RGB24_u2i( uint8_t *src_rgbx32, int32_t width, int32_t height,
                                         int8_t  *dst_rgb888, int32_t dst_width, int32_t dst_height,
                                         int32_t zero_point )
{
    int min_height = min( height, dst_height );
    int min_width  = min( width, dst_width );
    int offset_width = ( width - min_width ) >> 1;
    uint32_t    *src_32p = (uint32_t *)&src_rgbx32[offset_width << 1];

    for ( int i = 0; i < min_height; i++ ) 
    {
        int8_t      *dp = &dst_rgb888[i * dst_width * 3];
        uint32_t    *sp = &src_32p[i * width];

        for ( int j = 0; j < min_width; j++ ) 
        {
            uint32_t    pixel = *sp++;

            *dp++ = (int8_t)((pixel >> 16) + zero_point);
            *dp++ = (int8_t)((pixel >>  8) + zero_point);
            *dp++ = (int8_t)((pixel      ) + zero_point);
        }
    }
}
/******************************************************************************
* Function Name: draw_image_pixel
*******************************************************************************
* Summary:
*  Draws a single pixel on an LCD display by converting RGB888 color values to
*  RGB565 format and writing to the specified position in the destination 
*  buffer, provided the coordinates are within the LCD dimensions.
*
* Parameters:
*  uint16_t *pDst: Pointer to the destination LCD buffer (RGB565)
*  uint16_t x: X-coordinate of the pixel
*  uint16_t y: Y-coordinate of the pixel
*  uint16_t r: Red color value (0-255)
*  uint16_t g: Green color value (0-255)
*  uint16_t b: Blue color value (0-255)
*  uint16_t lcd_w: Width of the LCD display
*  uint16_t lcd_h: Height of the LCD display
*
* Return:
*  void
*
******************************************************************************/
void draw_image_pixel( uint16_t *pDst, uint16_t x, uint16_t y, uint16_t r, uint16_t g, uint16_t b, 
                       uint16_t lcd_w, uint16_t lcd_h )
{
    if ( x < lcd_w  &&  y < lcd_h ) {
        uint16_t rgb565 = ifx_pixel_RGB888_to_RGB565(r, g, b);

        pDst[(y * lcd_w) + x] = rgb565;
    }
}


/* [] END OF FILE */
